"use client";

import { useState } from "react";
import { motion, AnimatePresence } from "framer-motion";

const cards = [
  { id: 1, title: "ช่วงชีวิตวัย 0-7 ปี", content: "เริ่มเเรกมีเด็กคนหนึ่งเกิดมาในจังหวัดกรุงเทพมหานคร ในวันที่ 15 มีนาคม พ.ศ.2549 ณ โรงพยาบาลยันฮี เป็นเด็กผู้ชาย น้ำหนัก 4500 กรัม โดยผู้เป็นบิดามารดาให้ชื่อว่าเด็กชายปภังกร ปิจจวงค์ ที่หมายความว่าผู้สร้างรัศมี ผู้รุ่งเรือง โดย มีชื่อเล่นว่า ชีต้าร์ เพียงเพราะว่าบิดา หลงใหลใน สารคดี สัตว์ป่าเป็นอย่างมาก เเละ ชีต้าร์ได้อาศัยอยู่บริเวณฝั่งธน ของจังหวัดกรุงเทพมหานคร อยู่บ้านเช่าเเละได้เข้าเรียนที่โรงเรียนเตรียมอนุบาลเพียง 1 วันจึงออกมาเหตุผลเพียงเพราะว่าร้องไห้ตลอดทั้งวันผู้ปกครองจึงพาออกจากโรงเรียนเตรียมอนุบาล จากนั้นชีต้าร์มีอายุพร้อมที่จะเข้าโรงเรียนอนุบาล จึงเลือกเรียนโรงเรียนใกล้บ้านที่มีชื่อว่าโรงเรียนศรีอุลัย จนถึงอายุ 7 ปี ทางโรงเรียนได้พาไปทำบัตรประจำตัวประชาชนเป็นการทำบัตรประจำตัวประชาชนที่ตื่นเต้นมากเพราะว่าพนักงานให้สะกดชื่อตัวเองเป็นภาษาอังกฤษจึงสะกดผิดเเละก็ผิดมาถึงปัจจุบัน" },
  { id: 2, title: "ชช่วงชีวิตวัย 8-14 ปี", content: "ชีวิต 8 ปี ของชีต้าร์ก็ได้ย้ายมาอยู่พัทยาโดยมีเหตุผลเพราะว่าผู้ปกครองย้ายมาทำงานในพัทยาโดยกระชั้นชิด เเละชีต้าร์ก็ยังไม่มีที่เรียน เเต่ก็หาที่เรียนเจอ 3 วันสุดท้ายก่อนโรงเรียนเปิดเทอมเป็นหลักสูตรมินิอิงริชโปรแกรม โดยวันเปิดเรียนวันเเรกชีต้าร์ได้ใส่กางเกงสีน้ำเงินโดยที่เพื่อนๆใส่กางเกงสีดำเพราะว่าชีต้าร์หาชุดไม่ทันก่อนเปิดเรียน หลังจากจบประถมศึกษาปีที่ 6 ชีต้าร์ก็ได้สอบเข้าโรงเรียนโพธิสัมพันธ์พิทยาคาร สายการเรียนวิทย์-คณิต เเละก็มาถึงช่วงเกิดอุบัติเหตุครั้งใหญ่ที่เกิดจากการเล่นบาสเก็ต- บอลในจังหวะเข้าประทะหัวของชีต้าได้กระทบกับหัวเข่าเพื่อนเเละกระเเทกเข้ากับพื่นสนามบาสโรงเรียน เกิดการเย็บ 6-10 เข็ม เเละเพื่อนคนนั้นก็ยังรู้จักมาถึงทุกวันนี้ หลังผ่านจากอุบัติเหตุข้ามมาช่วงปี พ.ศ.2562 ซึ่งตรงกับชั้นมัธยมศึกษาปีที่ 3 ก็เกิดเหตุการไวรัสระบาดการมาโรงเรียนเลยไม่ปกติโดยเเบ่งกลุ่มๆ เป็นอะไรที่เเปลกมากๆ หลังจากจบชั้นมัธยมศึกษาปีที่ 3 ชีต้าร์ก็ได้เรียนต่อที่เดิมโดยใช่โควต้าของโรงเรียน เเละเลือกสายการเรียนวิทย์-คอมพิวเตอร์" },
  { id: 3, title: "ช่วงชีวิตวัย 15-21 ปี", content: "หลังจากขึ้นมัธยมศึกษาปีที่ 4 ก็ได้เรียนออนไลน์เป็นการเข้าเรียนทุกคาบที่ไม่ทราบอะไรเลยโดยเฉพาะวิชาตรรกศาสตร์เเต่ก็ผ่านการสอบมาได้ เเละวิชาที่ชอบที่สุดก็คงไม่พ้นวิชาคอมพิวเตอร์ที่ได้เรียนเทอมละ 2 รายวิชา จากนั้นก็เริ่มสนใจโปรเเกรมมิ่ง จนขึ้นมัธยมศึกษาปีที่ 5 ก็ได้เพื่อนไปเเข่งรายการต่างๆ เช่นการเเข่งขันหุ่นยนต์ การเเข่งขันเเขนกล ของมหาวิทยาลัยบูรพา รายการนี้ได้รางวัลคือการรับเข้าศึกษาก็ในคณะวิศวกรรมศาสตร์มหาวิทยาลัยบูรพาในรอบที่ 1 เเละยังมีการเเข่งขั้นสร้างเรือเก็บขยะของมหาวิทยาลัยบูรพา รายการนี้เป็นรายการที่เหนื่อยมากๆจำได้ว่าวันสงการต์ ชีต้าร์ก็ได้นั่งปั้นโมเดล 3 มิติเพื่อที่จะเอาไปปริ้น 3 มิติจนไม่ได้เที่ยวเเต่รายการนี้ก็สำเร็จไปได้ด้วยดี หลังจากเปิดเทอมสองของมัธยมศึกษาปีที่ 5 ไม่กี่สัปดาห์ คุณครูก็ได้ให้ไปลงเเข่งการเขียนโค้ดหุ่นยนต์กู้ภัยโดยใช้สถานการณ์จำลองเหมือนจริง ผ่านระบบออนไลน์ ผ่านเข้ารอบ 12 ทีมจาก90-100ทีม(ไม่เเน่ใจเเต่เกิน90ทีมเเน่ๆครับ) เเต่ ก็ได้อันดับที่ 5 เเต่ก็ได้เรียนรู้เกี่ยวคอมพิวเตอร์วิชชั้นเเบบเต็มๆ เเละได้มาเเข่งรายการโอเพนเฮ้าคณะวิทยาการสารสนเทศโดยมาเเข่งเขียนคำสั่งให้chatgptได้อันดับที่ 1 เป็นรายการที่สนุกที่สุดไม่เครียด เเละก็ถึงช่วงเปลี่ยนผ่านของชีวิตก็ต้องเลือกมหาวิทยาลัย ก็ได้ส่งพอร์ตรอบที่ 1 ไปมหาลัยต่างๆติดสัมภาษณ์เเต่ประกาศผลก็ไม่ติด เเละก็มาส่งพอร์ตที่มหาลัยบูรพาเลือกที่นี้เพราะมีความรู้สึกคุ้นเคยเเละมาบ่อยเเล้วก็ชอบสิ่งอำนวจความสะดวกจนได้ที่เรียนที่มหาวิทยาลัยบูรพา คณะวิทยาการสารสนเทศ สาขาวิทยาการคอมพิวเตอร์" },
  { id: 4, title: "ช่วงชีวิตวัย 22 ปี", content: "อายุยังไม่ถึงนะครับ" },
];

export const StackCards = () => {
  const [stack, setStack] = useState(cards);

  const handleRemove = (id: number) => {
    // วนการ์ดกลับมาที่หลังสุดของสแต็ก
    const newStack = [...stack];
    const cardToMove = newStack.find((card) => card.id === id);
    if (cardToMove) {
      newStack.splice(newStack.indexOf(cardToMove), 1);
      newStack.push(cardToMove);
      setStack(newStack);
    }
  };

  return (
    <div className="flex flex-col items-center p-40 h-[100vh] z-0">
      <h1 className="text-3xl font-bold mb-4 z-9 tracking-wide">About</h1>
      <div className="relative h-full w-100 mx-10  md:w-130 ">
        <AnimatePresence>
          {stack.map((card, index) => (
            <motion.div
              key={card.id}
              className="absolute mx-4 w-90 h-130 md:h-150  md:mx-0 md:w-full bg-white shadow-xl rounded-xl flex flex-col items-center  p-4 "
              style={{ left: index * 10, zIndex: stack.length - index }}
              initial={{ scale: 0.8, opacity: 0, y: 50 }}
              animate={{ scale: 1, opacity: 1, y: 0 }}
              exit={{ scale: 0.8, opacity: 0, y: -50}}
              transition={{ type: "spring", stiffness: 300, damping: 30 }}
              onClick={() => handleRemove(card.id)}
            >
              <h2 className="text-lg font-bold">{card.title}</h2>
              <p className="text-[12px] mt-5 md:text-[15px] m-2">{card.content}</p>
              <span className="absolute right-10 bottom-3 md:bottom-10 text-3xl cursor-pointer hover:text-black/30">→</span>
            </motion.div>
          ))}
        </AnimatePresence>
      </div>
    </div>
  );
}
export default StackCards
